n5/src/Catalogs/Prices/Prices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Prices</name>
  <owners>Catalog.Companies</owners>
  <attributes>
    <name>BasePrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Detail</name>
    <type>
      <types>EnumRef.PriceDetails</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Pricing</name>
    <type>
      <types>EnumRef.Pricing</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundMethod</name>
    <type>
      <types>EnumRef.Rounding</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundToNextPart</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/Pricing/Pricing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Pricing</name>
  <enumValues>
    <name>Base</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>ItemPercent</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>Cost</name>
  </enumValues>
  <enumValues>
    <name>Purchase</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PriceDetails/PriceDetails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PriceDetails</name>
  <enumValues>
    <name>Item</name>
  </enumValues>
  <enumValues>
    <name>ItemAndWarehouse</name>
  </enumValues>
  <enumValues>
    <name>ItemAndOrganization</name>
  </enumValues>
  <enumValues>
    <name>ItemAndWarehouseAndOrganization</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Prices/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	addToCheckPercentFields ( CheckedAttributes );
	
EndProcedure

Procedure addToCheckPercentFields ( CheckedAttributes )
	
	if ( Pricing <> Enums.Pricing.Base
		and Pricing <> Enums.Pricing.Cost
		and Pricing <> Enums.Pricing.Purchase ) then
		CheckedAttributes.Add ( "BasePrices" );
		CheckedAttributes.Add ( "RoundMethod" );
	endif; 
	if ( Pricing = Enums.Pricing.Percent ) then
		CheckedAttributes.Add ( "Percent" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( existRecursion () ) then
		Cancel = true;
	endif; 
	if ( calculationMethodChangeError () ) then
		Cancel = true;
	endif; 
	if ( detailChangeError () ) then
		Cancel = true;
	endif; 
	
EndProcedure

Function existRecursion ()
	
	currentBasePrice = BasePrices;
	while ( true ) do
		if ( currentBasePrice.IsEmpty () ) then
			return false;
		endif; 
		if ( currentBasePrice <> Ref ) then
			currentBasePrice = DF.Pick ( currentBasePrice, "BasePrices" );
		endif; 
		if ( not currentBasePrice.IsEmpty () )
			and ( currentBasePrice = BasePrices or currentBasePrice = Ref ) then
			Output.ExistPriceRecursion ( , "BasePrices" );
			return true;
		endif; 
	enddo; 
	
EndFunction 

Function calculationMethodChangeError ()
	
	if ( IsNew () ) then
		return false;
	endif; 
	if ( Ref.Pricing = Pricing ) then
		return false;
	endif;
	error = existRecordsWithThisPrices ();
	if ( error ) then
		Output.PriceCalculationMethodChangeError ( , "Pricing" );
	endif; 
	return error;
	
EndFunction 

Function existRecordsWithThisPrices ()
	
	s = "
	|select top 1 null
	|from InformationRegister.";
	if ( Ref.Pricing = Enums.Pricing.Group ) then
		s = s + "PriceGroups";
	else
		s = s + "Prices";
	endif; 
	s = s + " as Pricing
	|where Pricing.Prices = &Prices
	|";
	q = new Query ( s );
	q.SetParameter ( "Prices", Ref );
	return q.Execute ().Select ().Next ();
	
EndFunction 

Function detailChangeError ()
	
	if ( IsNew () ) then
		return false;
	endif; 
	if ( Ref.Detail = Detail ) or ( detailCanChange () ) then
		return false;
	endif;
	error = existRecordsWithThisPrices ();
	if ( error ) then
		Output.PriceDetailChangeError ( , "Detail" );
	endif; 
	return error;
	
EndFunction 

Function detailCanChange ()
	
	return Ref.Detail = Enums.PriceDetails.Item;

EndFunction 

#endif
